<a href="https://colab.research.google.com/github/vikasbda21/Feature_Engineering/blob/main/Categorical_Dummy%26One_Hot.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
col = ['town', 'area', 'price']
data = [['Delhi', 2600, 12000], ['Delhi', 1600, 8000], ['Delhi', 2200, 10000], ['Delhi', 3000, 20000], 
        ['Banglore', 2600, 20000], ['Banglore', 1600, 18000], ['Banglore', 2200, 25000], ['Banglore', 3000, 35000],
         ['Mumbai', 2600, 30000], ['Mumbai', 1600, 22000], ['Mumbai', 2200, 35000], ['Mumbai', 3000, 40000]]

In [ ]:
df = pd.DataFrame(data, columns=col)

In [ ]:
df

        town  area  price
0      Delhi  2600  12000
1      Delhi  1600   8000
2      Delhi  2200  10000
3      Delhi  3000  20000
4   Banglore  2600  20000
5   Banglore  1600  18000
6   Banglore  2200  25000
7   Banglore  3000  35000
8     Mumbai  2600  30000
9     Mumbai  1600  22000
10    Mumbai  2200  35000
11    Mumbai  3000  40000

**Using Dummy variable**

In [ ]:
dummies = pd.get_dummies(df.town)

In [ ]:
merged = pd.concat([df,dummies],axis=1)

In [ ]:
merged

        town  area  price  Banglore  Delhi  Mumbai
0      Delhi  2600  12000         0      1       0
1      Delhi  1600  10000         0      1       0
2      Delhi  2200  10500         0      1       0
3      Delhi  3000  20000         0      1       0
4   Banglore  2600  15000         1      0       0
5   Banglore  1600  11000         1      0       0
6   Banglore  2200  11000         1      0       0
7   Banglore  3000  25000         1      0       0
8     Mumbai  2600  25000         0      0       1
9     Mumbai  1600  22000         0      0       1
10    Mumbai  2200  21000         0      0       1
11    Mumbai  3000  35000         0      0       1

In [ ]:
# We don't neet town column
final = merged.drop(['town', 'Mumbai'], axis=1)

In [ ]:
# Drop one of the dummies variable to avoid the dummy variable trap.
final

    area  price  Banglore  Delhi
0   2600  12000         0      1
1   1600   8000         0      1
2   2200  10000         0      1
3   3000  20000         0      1
4   2600  20000         1      0
5   1600  18000         1      0
6   2200  25000         1      0
7   3000  35000         1      0
8   2600  30000         0      0
9   1600  22000         0      0
10  2200  35000         0      0
11  3000  40000         0      0

**Create Linear Regression Model**

In [ ]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [ ]:
X = final.drop('price', axis=1)

In [ ]:
y = final['price']

In [ ]:
model.fit(X,y)

LinearRegression()

In [ ]:
model.score(X,y)

0.8837746606933587

In [ ]:
model.predict([[39000,0,0]])

/usr/local/lib/python3.7/dist-packages/sklearn/base.py:446: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"

array([382836.44859813])

**One Hot Encoding**